package com.example.homeforall;

import java.util.ArrayList;

public class AppConstants {

    public final static String [] ANIMALS={"כלבים","חתולים","ציפורים","דגים","זוחלים","מכרסמים","חיות משק"};
    public final static String [] ANIMALS_ALL={"הכל","כלבים","חתולים","ציפורים","דגים","זוחלים","מכרסמים","חיות משק"};
    public final static String [] DOG_BREED={"מעורב","אלסקן מלאמוט","אפנפינצ'ר","אקיטה","באסט","בול","בולדוג","גולדן רטריבר","דוברמן","דלמטי","האסקי סיברי","הרים","טוי טרייר","טרייר","יורקשייר","כנעני",
            "לברדור","מסטיף","מלטז","סטר","פודל","פינצ'ר","פקינז","צ'יוואווה","קוקר ספניאל","רועה","רטריבר","שארפיי","אחר"};
    public final static String [] DOG_BREED_ALL={"הכל","מעורב","אלסקן מלאמוט","אפנפינצ'ר","אקיטה","באסט","בול","בולדוג","גולדן רטריבר","דוברמן","דלמטי","האסקי סיברי","הרים","טוי טרייר","טרייר","יורקשייר","כנעני",
            "לברדור","מסטיף","מלטז","סטר","פודל","פינצ'ר","פקינז","צ'יוואווה","קוקר ספניאל","רועה","רטריבר","שארפיי","אחר"};
    public final static String [] CAT_BREED={"אנגורה","אקזוטי קצר שיער","בנגלי","בריטי","הימלאיה","מעורב","מיין קון","סיאמי","סקוטי","פרסי","רגדול","פרסי","אחר"};
    public final static String [] CAT_BREED_ALL={"הכל","אנגורה","אקזוטי קצר שיער","בנגלי","בריטי","הימלאיה","מעורב","מיין קון","סיאמי","סקוטי","פרסי","רגדול","פרסי","אחר"};
    public final static String [] BIRD_BREED={"אלכסנדרין","אמזונה","אקלקטוס","ארה","בורקיס","דררה","ז'אקו"," יונים","כנרית","לורי","סנגל","פיונוס","פסיפיק","ציפורי אהבה","קוואקר","קקדו","רוזלה","שלו","אחר"};
    public final static String [] BIRD_BREED_ALL={"הכל","אלכסנדרין","אמזונה","אקלקטוס","ארה","בורקיס","דררה","ז'אקו"," יונים","כנרית","לורי","סנגל","פיונוס","פסיפיק","ציפורי אהבה","קוואקר","קקדו","רוזלה","שלו","אחר"};
    public final static String [] FISH_BREED={"דגי חתולים","דגי מים מלוחים","דגי מים קרים","דגים טרופיים","חריתיים","משריצי חיים","נאוותים","ציקלידים","אחר"};
    public final static String [] FISH_BREED_ALL={"הכל","דגי חתולים","דגי מים מלוחים","דגי מים קרים","דגים טרופיים","חריתיים","משריצי חיים","נאוותים","ציקלידים","אחר"};
    public final static String [] REPTILE_BREED={"איגואנה","אנדרוס","בואה","בורמזי אלבינו","בירית","ג'אגל","דורנגו","חרדין","פיתון","קינג","שממית","אחר"};
    public final static String [] REPTILE_BREED_ALL={"הכל","איגואנה","הכל","אנדרוס","בואה","בורמזי אלבינו","בירית","ג'אגל","דורנגו","חרדין","פיתון","קינג","שממית","אחר"};
    public final static String [] RODENT_BREED={"אוגר","ארנב","גרביל","צ'נצ'ילה","חולדה","סנאי מעופף","עכבר","שרקו","אחר"};
    public final static String [] RODENT_BREED_ALL={"הכל","אוגר","ארנב","גרביל","צ'נצ'ילה","חולדה","סנאי מעופף","עכבר","שרקו","אחר"};
    public final static String [] FARM_ANIMALS_BREED={"תרנגול","חמור","כבש","עז","פרה","סוס","אחר"};
    public final static String [] FARM_ANIMALS_BREED_ALL={"הכל","תרנגול","חמור","כבש","עז","פרה","סוס","אחר"};
    public final static String [] LOCATION={"צפון","חיפה-קריות והסביבה","עכו-נהריה והסביבה","כנרת והסביבה","כרמיאל והסביבה","נצרת-שפרעם והסביבה","גליל תחתון והסביבה","גליל עליון-גולן",
            "חדרה זכרון והעמקים","זכרון וחוף כרמל","חדרה-קיסריה והסביבה","יקנעם-טבעון והסביבה","עמק בית שאן","עפולה והעמקים",
            "שרון","נתניה והסביבה","רמת השרון-הרצליה","רעננה-כפר סבא","הוד השרון והסביבה","דרום השרון","צפון השרון",
             "מרכז","תל אביב","ראשון-לציון והסביבה","חולון-בת ים","רמת גן-גבעתיים","פתח תקווה והסביבה","ראש העין והסביבה","בקעת האונו","רמלה-לוד","בני ברק-גבעת שמואל","שוהם והסביבה","מודעין והסביבה",
             "אזור ירושלים","בית שמש והסביבה","הרי יהודה-מברשת והסביבה","מעלה אדומים והסביבה",
            "יהודה שומרון ובקעת הירדן","ישובי שומרון","גוש עציון","בקעת הירדן וצפון ים מלח","אריאל וישובי יהודה",
            "שפלה ומישור החוף הדרומי","נס ציונה-רחובות","אשדוד-אשקלון והסביבה","גדרה-יבנה והסביבה","קריית גת והסביבה","שפלה",
            "דרום","באר שבע והסביבה","אילת וערבה","ישובי נגב","דרום ים המלח","הנגב המערבי"};
    public final static String [] LOCATION_ALL={"הכל","צפון","חיפה-קריות והסביבה","עכו-נהריה והסביבה","כנרת והסביבה","כרמיאל והסביבה","נצרת-שפרעם והסביבה","גליל תחתון והסביבה","גליל עליון-גולן",
            "חדרה זכרון והעמקים","זכרון וחוף כרמל","חדרה-קיסריה והסביבה","יקנעם-טבעון והסביבה","עמק בית שאן","עפולה והעמקים",
            "שרון","נתניה והסביבה","רמת השרון-הרצליה","רעננה-כפר סבא","הוד השרון והסביבה","דרום השרון","צפון השרון",
            "מרכז","תל אביב","ראשון-לציון והסביבה","חולון-בת ים","רמת גן-גבעתיים","פתח תקווה והסביבה","ראש העין והסביבה","בקעת האונו","רמלה-לוד","בני ברק-גבעת שמואל","שוהם והסביבה","מודעין והסביבה",
            "אזור ירושלים","בית שמש והסביבה","הרי יהודה-מברשת והסביבה","מעלה אדומים והסביבה",
            "יהודה שומרון ובקעת הירדן","ישובי שומרון","גוש עציון","בקעת הירדן וצפון ים מלח","אריאל וישובי יהודה",
            "שפלה ומישור החוף הדרומי","נס ציונה-רחובות","אשדוד-אשקלון והסביבה","גדרה-יבנה והסביבה","קריית גת והסביבה","שפלה",
            "דרום","באר שבע והסביבה","אילת וערבה","ישובי נגב","דרום ים המלח","הנגב המערבי"};
    public final static String[][] BREED_MATRIX={DOG_BREED,CAT_BREED,BIRD_BREED,FISH_BREED,REPTILE_BREED,RODENT_BREED,FARM_ANIMALS_BREED};

    public final static String[] ANIMAL_DB_ADAPTER ={"dogs","cats","birds","fish","reptile","rodent","farm_animal"};
    public static final String MALE="זכר";
    public static final String OWNER="adOwner";
    public static final String OWNER_PHONE="phoneNumber";
    public static final String FEMALE="נקבה";
    public static final String[] GENDER={"שני המינים",MALE,FEMALE};

}

